## Production: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.allow_cloudfront_to_access_static_website_in_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_cloudfront_to_access_static_website_in_s3" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_acm_certificate.form_viewer_maintenance_mode will be created
  + resource "aws_acm_certificate" "form_viewer_maintenance_mode" {
      + arn                       = (known after apply)
      + domain_name               = "forms-formulaires.alpha.canada.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "forms-formulaires.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_cloudfront_distribution.maintenance_mode will be created
  + resource "aws_cloudfront_distribution" "maintenance_mode" {
      + aliases                        = [
          + "forms-formulaires.alpha.canada.ca",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true
      + web_acl_id                     = (known after apply)

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "MaintenanceMode"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "MaintenanceMode"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2019"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_origin_access_identity.maintenance_mode will be created
  + resource "aws_cloudfront_origin_access_identity" "maintenance_mode" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "Access Identity for the Maintenance Website"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # aws_lb_target_group.form_viewer_1 will be updated in-place
  ~ resource "aws_lb_target_group" "form_viewer_1" {
        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:targetgroup/form-viewer/8dac72758c8ecdcc"
        name                               = "form-viewer"
        tags                               = {
            "CostCentre" = "forms-platform-production"
            "Name"       = "form_viewer_1"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "301,200" -> "200"
            # (8 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.form_viewer_2 will be updated in-place
  ~ resource "aws_lb_target_group" "form_viewer_2" {
        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:targetgroup/form-viewer-2/a03ac97959b5fb63"
        name                               = "form-viewer-2"
        tags                               = {
            "CostCentre" = "forms-platform-production"
            "Name"       = "form_viewer_2"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "301,200" -> "200"
            # (8 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_route53_record.form_viewer[0] will be updated in-place
  ~ resource "aws_route53_record" "form_viewer" {
        id             = "Z1031499PBK3926Y7HKK_forms-formulaires.alpha.canada.ca_A"
        name           = "forms-formulaires.alpha.canada.ca"
      + set_identifier = "form_viewer_forms-formulaires.alpha.canada.ca_primary"
        # (5 unchanged attributes hidden)

      + failover_routing_policy {
          + type = "PRIMARY"
        }

        # (1 unchanged block hidden)
    }

  # aws_route53_record.form_viewer[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_route53_record" "form_viewer" {
      - fqdn    = "forms-formulaires.canada.ca" -> null
      - id      = "Z0774184336K3QX9DUJ7E_forms-formulaires.canada.ca_A" -> null
      - name    = "forms-formulaires.canada.ca" -> null
      - records = [] -> null
      - ttl     = 0 -> null
      - type    = "A" -> null
      - zone_id = "Z0774184336K3QX9DUJ7E" -> null

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "form-viewer-1039776084.ca-central-1.elb.amazonaws.com" -> null
          - zone_id                = "ZQSVJUPU6J1EY" -> null
        }
    }

  # aws_route53_record.form_viewer_maintenance[0] will be created
  + resource "aws_route53_record" "form_viewer_maintenance" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "forms-formulaires.alpha.canada.ca"
      + set_identifier  = "form_viewer_forms-formulaires.alpha.canada.ca_secondary"
      + type            = "A"
      + zone_id         = "Z1031499PBK3926Y7HKK"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }

      + failover_routing_policy {
          + type = "SECONDARY"
        }
    }

  # aws_s3_bucket.maintenance_mode will be created
  + resource "aws_s3_bucket" "maintenance_mode" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "gc-forms-application-maintenance-page"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.maintenance_mode will be created
  + resource "aws_s3_bucket_acl" "maintenance_mode" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_object.maintenance_static_page_css_files["style.css"] will be created
  + resource "aws_s3_bucket_object" "maintenance_static_page_css_files" {
      + acl                    = "private"
      + bucket                 = "gc-forms-application-maintenance-page"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css"
      + etag                   = "92fa1c75f720e83330756f94b06aa8bf"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "style.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/style.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.maintenance_static_page_html_files["index-fr.html"] will be created
  + resource "aws_s3_bucket_object" "maintenance_static_page_html_files" {
      + acl                    = "private"
      + bucket                 = "gc-forms-application-maintenance-page"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "5c195ef016b9e898437a543aba2301ac"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index-fr.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/index-fr.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.maintenance_static_page_html_files["index.html"] will be created
  + resource "aws_s3_bucket_object" "maintenance_static_page_html_files" {
      + acl                    = "private"
      + bucket                 = "gc-forms-application-maintenance-page"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "f15e6aa2fd75c9b6b97d93d2b1fedfbd"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.maintenance_static_page_ico_files["favicon.ico"] will be created
  + resource "aws_s3_bucket_object" "maintenance_static_page_ico_files" {
      + acl                    = "private"
      + bucket                 = "gc-forms-application-maintenance-page"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = "58bd7822fbbd5642104beae2b25a1b5b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_object.maintenance_static_page_svg_files["site-unavailable.svg"] will be created
  + resource "aws_s3_bucket_object" "maintenance_static_page_svg_files" {
      + acl                    = "private"
      + bucket                 = "gc-forms-application-maintenance-page"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "1d263a8e324e88ea09c9b630de277c45"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "site-unavailable.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./static_website/site-unavailable.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_policy.allow_cloudfront_to_access_static_website_in_s3 will be created
  + resource "aws_s3_bucket_policy" "allow_cloudfront_to_access_static_website_in_s3" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.maintenance_mode will be created
  + resource "aws_s3_bucket_public_access_block" "maintenance_mode" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.maintenance_mode will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "maintenance_mode" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_website_configuration.maintenance_mode will be created
  + resource "aws_s3_bucket_website_configuration" "maintenance_mode" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

  # aws_wafv2_regex_pattern_set.forms_base_url will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "forms_base_url" {
        id          = "e1ceb832-c7e4-4b53-a818-44a55e27b3e4"
        name        = "forms_base_url"
        tags        = {}
        # (5 unchanged attributes hidden)

      - regular_expression {
          - regex_string = "^forms-formulaires.canada.ca$" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_wafv2_regex_pattern_set.valid_maintenance_mode_uri_paths will be created
  + resource "aws_wafv2_regex_pattern_set" "valid_maintenance_mode_uri_paths" {
      + arn         = (known after apply)
      + description = "Regex to match the maintenance page valid URIs"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "valid_maintenance_page_uri_paths"
      + scope       = "CLOUDFRONT"
      + tags_all    = (known after apply)

      + regular_expression {
          + regex_string = "^\\/(index.html|index-fr.html|style.css|site-unavailable.svg|favicon.ico)?$"
        }
    }

  # aws_wafv2_web_acl.forms_maintenance_mode_acl will be created
  + resource "aws_wafv2_web_acl" "forms_maintenance_mode_acl" {
      + arn        = (known after apply)
      + capacity   = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "GCFormsMaintenanceMode"
      + scope      = "CLOUDFRONT"
      + tags       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all   = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }

      + default_action {
          + block {
            }
        }

      + rule {
          + name     = "AllowGetOnMaintenancePageHTMLResources"
          + priority = 0

          + action {
              + allow {
                }
            }

          + statement {
              + and_statement {
                  + statement {
                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "GET"

                          + field_to_match {
                              + method {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "NONE"
                            }
                        }
                    }
                  + statement {
                      + regex_pattern_set_reference_statement {
                          + arn = (known after apply)

                          + field_to_match {
                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "COMPRESS_WHITE_SPACE"
                            }
                          + text_transformation {
                              + priority = 2
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AllowGetOnMaintenancePageHTMLResources"
              + sampled_requests_enabled   = false
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = false
          + metric_name                = "forms_maintenance_mode_global_rule"
          + sampled_requests_enabled   = false
        }
    }

Plan: 17 to add, 4 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.firehose_waf_logs,
  on kinesis.tf line 30, in resource "aws_s3_bucket" "firehose_waf_logs":
  30: resource "aws_s3_bucket" "firehose_waf_logs" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 5 more similar warnings elsewhere)

Error: Error in function call

  on route53.tf line 48, in locals:
  48:   domain_name_to_zone_id = zipmap(var.domains, var.hosted_zone_ids)
    ├────────────────
    │ while calling zipmap(keys, values)
    │ var.domains is list of string with 1 element
    │ var.hosted_zone_ids is list of string with 2 elements

Call to function "zipmap" failed: number of keys (1) does not match number of
values (2).
time=2023-12-11T18:01:59Z level=error msg=terraform invocation failed in /home/runner/work/forms-terraform/forms-terraform/env/cloud/load_balancer/.terragrunt-cache/8CJu3E6tls1VOlHT6vQAFFRgrcQ/-syjFrdAaB-6kNXhMmF1nXBOp7o/load_balancer prefix=[/home/runner/work/forms-terraform/forms-terraform/env/cloud/load_balancer] 
time=2023-12-11T18:01:59Z level=error msg=1 error occurred:
	* [/home/runner/work/forms-terraform/forms-terraform/env/cloud/load_balancer/.terragrunt-cache/8CJu3E6tls1VOlHT6vQAFFRgrcQ/-syjFrdAaB-6kNXhMmF1nXBOp7o/load_balancer] exit status 1



```

</details>

